src/Enums/СоцСети/СоцСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоцСети</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
  <enumValues>
    <name>VKT</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сообщества/Сообщества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщества</name>
  <predefined>
    <items>
      <name>Athenaeum</name>
      <description>Two- Digit Athenaeum</description>
    </items>
    <items>
      <name>Тест</name>
      <description>Тест</description>
    </items>
  </predefined>
  <attributes>
    <name>ВК_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_V</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_group_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_owner_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_access_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitysecret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitytoken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_chat_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаVK</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TGB_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDАльбома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКомпании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_Кабинет</name>
    <type>
      <types>CatalogRef.РекламныеКабинеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_ДневнойЛимитНаЗапись</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКатегории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъявлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйУровеньПоста</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщества</name>
    <type>
      <types>EnumRef.ТипыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскруткаБотами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСложноПосты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСложнопостов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьСтатистику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Объявления</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/HTTPServices/Bot/Module.bsl
#Область ОбработчикиСобытий

Функция tgbotlogIn(Запрос)	
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		
	СтруктураПараметров		= Новый Структура;
	Ответ 					= Новый HTTPСервисОтвет(200);
	ТелоДД 					= Запрос.ПолучитьТелоКакДвоичныеДанные();
	ТелоСтрока				= Запрос.ПолучитьТелоКакСтроку();
		                                                       
	ОтветОбъект = МетодыРаботыHttp.JsonВСтруктуру(ТелоДД);
	
	СтруктураПараметров.Вставить("Секрет"		, "");
	СтруктураПараметров.Вставить("ВидСоцСети"	, Перечисления.СоцСети.Telegram);
	
	Если ОтветОбъект.Свойство("message") Тогда
		
		ПолучитьСтруктуруПараметровИзСообщения(ОтветОбъект, СтруктураПараметров);
				
	ИначеЕсли ОтветОбъект.Свойство("callback_query") Тогда
		
		ПолучитьСтруктуруПараметровИзКлавиатуры(ОтветОбъект, СтруктураПараметров);
		
	ИначеЕсли  ОтветОбъект.Свойство("my_chat_member") Тогда
		
		ПолучитьСтруктуруПараметровИзСтатуса(ОтветОбъект, СтруктураПараметров);
		Возврат Ответ;	
									
	Иначе
		
		 ИнструментарийВызовСервера.ЗаписьВЖурналИсключений("Не message и не my_chat_memebr в запросе от Telegram"
		 	, ТелоСтрока);
		 Возврат Ответ;
		
	КонецЕсли;
									
	МетодыБота.ОбработатьВходящееСообщение(СтруктураПараметров);
		
	Исключение
	ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки(), ТелоСтрока);
	КонецПопытки;
	              
	Возврат Ответ;
	
КонецФункции

Функция tgbotgetLog(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция vklogintakeData(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(307);
	Ответ.Заголовки.Вставить("Location", "https://athenaeum.digital/profile"); 

	Попытка
	Токен 		= Запрос.ПараметрыЗапроса.Получить("code");
	Печенька	= Запрос.ПараметрыЗапроса.Получить("uuid");
	КодКниги	= "";
	
	Если СтрНайти(Печенька, "_") > 0 Тогда
		
		МассивПараметра = СтрРазделить(Печенька, "_", Истина);
		Печенька		= МассивПараметра[0];
		КодКниги		= ?(МассивПараметра.Количество() > 1, МассивПараметра[1], "");
		
	КонецЕсли;
	
	КодВК 		= МетодыБота.АвторизоватьПользователяНаСайте(Токен, Печенька, КодКниги);
	Редирект	= 302;
	
	Если КодВК = Редирект Тогда
		Ответ.Заголовки.Вставить("Location", "https://vk.com/im?sel=-218704372"); 
	КонецЕсли;
		
	Исключение
	ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция vkbottakeData(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("ok");
	
	Попытка
		
	СтрокаЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON 	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаЗапроса);
	ОтветОбъект = ПрочитатьJSON(ЧтениеJSON);
	
	Откуда 	= Строка(ОтветОбъект.object.message.from_id);
	Куда	= Строка(ОтветОбъект.object.message.peer_id);
	
	Если Откуда <> Куда Тогда 
		Возврат Ответ;
	КонецЕсли;
	
	ИдентификаторПользователя 	= Строка(ОтветОбъект.object.message.from_id);
	ИдентификаторЧата			= ОтветОбъект.object.message.conversation_message_id;
	ТекстСообщения 				= СокрЛП(ОтветОбъект.object.message.text);
	Секрет 						= ОтветОбъект.secret;
	ИмяПользователя				= "Новый";
	
	СтруктураПараметров			= Новый Структура;
	СтруктураПараметров.Вставить("ИдентификаторПользователя"	, ИдентификаторПользователя);
	СтруктураПараметров.Вставить("ИдентификаторЧата"			, ИдентификаторЧата);
	СтруктураПараметров.Вставить("ТекстСообщения"				, ТекстСообщения);
	СтруктураПараметров.Вставить("ВидСоцСети"					, Перечисления.СоцСети.VK);
	СтруктураПараметров.Вставить("ИмяПользователя"				, ИмяПользователя);
	СтруктураПараметров.Вставить("Секрет"						, Секрет);
	СтруктураПараметров.Вставить("Никнейм"						, "");
	
	МетодыБота.ОбработатьВходящееСообщение(СтруктураПараметров);
	
	Исключение
	ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки(), СтрокаЗапроса);
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

Функция vkbotcallBack(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция takeStartsendData(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		
	Печенька 			= Запрос.ПараметрыЗапроса.Получить("cookie");
	Количество 			= Запрос.ПараметрыЗапроса.Получить("book");
	Назначение			= Запрос.ПараметрыЗапроса.Получить("social");
	ПользовательИБ		= МетодыApiСайта.ВернутьПользователяПоCookie(Печенька);
	
	ПоляПользователя 	= ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(ПользовательИБ
		, "Telegram,VK,РазрешилПисатьVK");
	
	ЗапретТГ = (Назначение = "tg" И Не ЗначениеЗаполнено(ПоляПользователя.Telegram));
	ЗапретВК = (Назначение = "vk" И (Не ЗначениеЗаполнено(ПоляПользователя.VK) Или Не ПоляПользователя.РазрешилПисатьVK));
	
	Если ЗапретТГ ИЛИ ЗапретВК Тогда		
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	КонецЕсли;
	
	СтруктураПараметров			= Новый Структура;
	СтруктураПараметров.Вставить("ИмяПользователя"				, "Новый");
	СтруктураПараметров.Вставить("ТекстСообщения"				, Количество);
	СтруктураПараметров.Вставить("Никнейм"						, "");
	СтруктураПараметров.Вставить("Секрет"						, 
		ИнструментарийВызовСервера.ЗначениеРеквизитаОбъекта(Справочники.Сообщества.Athenaeum, "ВК_communitysecret"));
	
	Если Назначение = "tg" Тогда
		
		СтруктураПараметров.Вставить("ИдентификаторПользователя", МетодыРаботыHttp.ЧислоВСтроку(ПоляПользователя.Telegram));
		СтруктураПараметров.Вставить("ИдентификаторЧата"		, МетодыРаботыHttp.ЧислоВСтроку(ПоляПользователя.Telegram));	
		СтруктураПараметров.Вставить("ВидСоцСети"				, Перечисления.СоцСети.Telegram);
		
	ИначеЕсли Назначение = "vk" Тогда
		
		СтруктураПараметров.Вставить("ИдентификаторПользователя"	, МетодыРаботыHttp.ЧислоВСтроку(ПоляПользователя.VK));
		СтруктураПараметров.Вставить("ИдентификаторЧата"			, МетодыРаботыHttp.ЧислоВСтроку(ПоляПользователя.VK));	
		СтруктураПараметров.Вставить("ВидСоцСети"					, Перечисления.СоцСети.VK);
		
	Иначе
		
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений("SendBook без Social"
			, МетодыРаботыHttp.JSONСтрокой(Запрос.ПараметрыЗапроса));
			
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
		
	КонецЕсли;

	МетодыБота.ОбработатьВходящееСообщение(СтруктураПараметров);
	
	Исключение
	ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

Функция takeStartcallBack(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция tgbotcallBack(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция vklogincallBack(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция vkbotcors(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьСтруктуруПараметровИзСообщения(Знач ОтветОбъект, СтруктураПараметров)

	Никнейм	= ?(ОтветОбъект.message.from.Свойство("username"), ОтветОбъект.message.from.username, "");

	ИдентификаторПользователя 	= ОтветОбъект.message.from.id;
	ИдентификаторЧата 			= ОтветОбъект.message.chat.id;
	ТекстСообщения				= ОтветОбъект.message.text;
	ИмяПользователя				= ?(ОтветОбъект.message.from.Свойство("first_name"),
		ОтветОбъект.message.from.first_name + " ", "") + ?(ОтветОбъект.message.from.Свойство("last_name"),
		ОтветОбъект.message.from.last_name, "");

	СтруктураПараметров.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
	СтруктураПараметров.Вставить("ИдентификаторЧата", ИдентификаторЧата);
	СтруктураПараметров.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураПараметров.Вставить("ИмяПользователя", ИмяПользователя);
	СтруктураПараметров.Вставить("Никнейм", Никнейм);

КонецПроцедуры

Процедура ПолучитьСтруктуруПараметровИзСтатуса(Знач ОтветОбъект, СтруктураПараметров)

	FromID				= МетодыРаботыHttp.ЧислоВСтроку(ОтветОбъект.my_chat_member.from.id);
	НовыйСтатус 		= ОтветОбъект.my_chat_member.new_chat_member.status;
	ПользовательИБ		= Справочники.Пользователи.НайтиПоРеквизиту("Telegram", FromID);

	ОбъектПользователь  = ПользовательИБ.ПолучитьОбъект();

	Если НовыйСтатус = "kicked" Тогда
		ОбъектПользователь.ТГ_БотОстановлен = Истина;
	Иначе
		ОбъектПользователь.ТГ_БотОстановлен = Ложь;
	КонецЕсли;

	ОбъектПользователь.Записать();

КонецПроцедуры

Процедура ПолучитьСтруктуруПараметровИзКлавиатуры(Знач ОтветОбъект, СтруктураПараметров)

	Никнейм	= ?(ОтветОбъект.callback_query.from.Свойство("username"), ОтветОбъект.callback_query.from.username, "");

	ИдентификаторПользователя 	= ОтветОбъект.callback_query.from.id;
	ИдентификаторЧата 			= ОтветОбъект.callback_query.message.chat.id;
	ТекстСообщения				= ОтветОбъект.callback_query.data;
	ИмяПользователя				= ?(ОтветОбъект.callback_query.from.Свойство("first_name"),
		ОтветОбъект.callback_query.from.first_name + " ", "") + ?(ОтветОбъект.callback_query.from.Свойство("last_name"),
		ОтветОбъект.callback_query.from.last_name, "");

	СтруктураПараметров.Вставить("ИдентификаторПользователя", ИдентификаторПользователя);
	СтруктураПараметров.Вставить("ИдентификаторЧата", ИдентификаторЧата);
	СтруктураПараметров.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураПараметров.Вставить("ИмяПользователя", ИмяПользователя);
	СтруктураПараметров.Вставить("Никнейм", Никнейм);
	
КонецПроцедуры
#КонецОбласти
